Revit 2027 API
DividedPath.TotalPathLength Property
 The sum of the curve lengths.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TotalPathLength { get; }
Public ReadOnly Property TotalPathLength As Double
	Get
public:
property double TotalPathLength {
	double get ();
}
member TotalPathLength : float with get
Property Value
Double
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace